# pandas

In [121]:
import pandas as pd
import numpy as np

In [122]:
#pandas数据结构
obj = pd.Series([4,7,-5,3])

In [123]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [124]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [125]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [126]:
obj2=pd.Series([4,7,-4,3],index=list('abcd'))

In [127]:
obj2

a    4
b    7
c   -4
d    3
dtype: int64

In [128]:
obj2['a']

4

In [129]:
obj2[obj2>0]

a    4
b    7
d    3
dtype: int64

In [130]:
obj2*2

a     8
b    14
c    -8
d     6
dtype: int64

In [131]:
np.exp(obj2)

a      54.598150
b    1096.633158
c       0.018316
d      20.085537
dtype: float64

In [132]:
stats={
    1:'huangyu',
    2:'nihao',
    3:'hello',
    4:'world'
}
stat=[1,2,3,5]

In [133]:
pd.Series(stats)

1    huangyu
2      nihao
3      hello
4      world
dtype: object

In [134]:
a=pd.Series(stats,index=stat)
a

1    huangyu
2      nihao
3      hello
5        NaN
dtype: object

In [135]:
pd.isnull(a)

1    False
2    False
3    False
5     True
dtype: bool

In [136]:
a.isnull()

1    False
2    False
3    False
5     True
dtype: bool

In [137]:
#自动对齐
a=pd.Series([1,2,3,4],index=list('abcd'))
b=pd.Series([5,6,7,8],index=list('abfr'))
a

a    1
b    2
c    3
d    4
dtype: int64

In [138]:
b

a    5
b    6
f    7
r    8
dtype: int64

In [139]:
a+b

a    6.0
b    8.0
c    NaN
d    NaN
f    NaN
r    NaN
dtype: float64

In [140]:
#给Series取名字
a.index.name='haungyu'

In [141]:
a.name='huangyu'

In [142]:
a

haungyu
a    1
b    2
c    3
d    4
Name: huangyu, dtype: int64

In [143]:
a.index=list('fghi')

In [144]:
a

f    1
g    2
h    3
i    4
Name: huangyu, dtype: int64

In [145]:
from sklearn import datasets

In [146]:
iris=datasets.load_iris()

In [147]:
X=iris.data

In [148]:
X.shape

(150, 4)

In [149]:
X[:10]

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2],
       [4.6, 3.1, 1.5, 0.2],
       [5. , 3.6, 1.4, 0.2],
       [5.4, 3.9, 1.7, 0.4],
       [4.6, 3.4, 1.4, 0.3],
       [5. , 3.4, 1.5, 0.2],
       [4.4, 2.9, 1.4, 0.2],
       [4.9, 3.1, 1.5, 0.1]])

In [150]:
data={
    'huangyu':list('abcdfgd'),
    'pihao':list('efghdfg'),
    'houpeng':list('igklert')
}

In [151]:
df=pd.DataFrame(data)

In [152]:
df

  huangyu pihao houpeng
0       a     e       i
1       b     f       g
2       c     g       k
3       d     h       l
4       f     d       e
5       g     f       r
6       d     g       t

In [153]:
df.head()

  huangyu pihao houpeng
0       a     e       i
1       b     f       g
2       c     g       k
3       d     h       l
4       f     d       e

In [154]:
df

  huangyu pihao houpeng
0       a     e       i
1       b     f       g
2       c     g       k
3       d     h       l
4       f     d       e
5       g     f       r
6       d     g       t

In [155]:
df1=pd.DataFrame(data,columns=['huangyu','pihao','houpeng',5],index=['huangyu','pihao','houpen','lixuqing','qiujing','reshaobo','zangzhouwei'])
df1

            huangyu pihao houpeng    5
huangyu           a     e       i  NaN
pihao             b     f       g  NaN
houpen            c     g       k  NaN
lixuqing          d     h       l  NaN
qiujing           f     d       e  NaN
reshaobo          g     f       r  NaN
zangzhouwei       d     g       t  NaN

In [156]:
#检索列
df1['huangyu']

huangyu        a
pihao          b
houpen         c
lixuqing       d
qiujing        f
reshaobo       g
zangzhouwei    d
Name: huangyu, dtype: object

In [157]:
df1[5]=None

In [158]:
df1

            huangyu pihao houpeng     5
huangyu           a     e       i  None
pihao             b     f       g  None
houpen            c     g       k  None
lixuqing          d     h       l  None
qiujing           f     d       e  None
reshaobo          g     f       r  None
zangzhouwei       d     g       t  None

In [159]:
df1[5]

huangyu        None
pihao          None
houpen         None
lixuqing       None
qiujing        None
reshaobo       None
zangzhouwei    None
Name: 5, dtype: object

In [160]:
value=pd.Series([1,2,3,4],index=['huangyu','pihao','reshaobo','qiujing'])

In [161]:
df1[5]=value

In [162]:
df1

            huangyu pihao houpeng    5
huangyu           a     e       i  1.0
pihao             b     f       g  2.0
houpen            c     g       k  NaN
lixuqing          d     h       l  NaN
qiujing           f     d       e  4.0
reshaobo          g     f       r  3.0
zangzhouwei       d     g       t  NaN

In [163]:
df1['huangyu1'] = df1.huangyu == 'a'

In [164]:
df1

            huangyu pihao houpeng    5  huangyu1
huangyu           a     e       i  1.0      True
pihao             b     f       g  2.0     False
houpen            c     g       k  NaN     False
lixuqing          d     h       l  NaN     False
qiujing           f     d       e  4.0     False
reshaobo          g     f       r  3.0     False
zangzhouwei       d     g       t  NaN     False

In [165]:
del df1['huangyu1']

In [166]:
df1

            huangyu pihao houpeng    5
huangyu           a     e       i  1.0
pihao             b     f       g  2.0
houpen            c     g       k  NaN
lixuqing          d     h       l  NaN
qiujing           f     d       e  4.0
reshaobo          g     f       r  3.0
zangzhouwei       d     g       t  NaN

In [167]:
df1.T

        huangyu pihao houpen lixuqing qiujing reshaobo zangzhouwei
huangyu       a     b      c        d       f        g           d
pihao         e     f      g        h       d        f           g
houpeng       i     g      k        l       e        r           t
5             1     2    NaN      NaN       4        3         NaN

In [168]:
df3={
    'huangyu':df1['huangyu'][:2],
    'pihao':df1['pihao'][:2]
}

In [169]:
a=pd.DataFrame(df3)

In [170]:
a

        huangyu pihao
huangyu       a     e
pihao         b     f

In [171]:
a.index.name ='name'

In [172]:
a.columns.name='name1'

In [173]:
a

name1   huangyu pihao
name
huangyu       a     e
pihao         b     f

In [174]:
a.dtypes

name1
huangyu    object
pihao      object
dtype: object

In [175]:
a.values

array([['a', 'e'],
       ['b', 'f']], dtype=object)

In [176]:
#索引对象
a

name1   huangyu pihao
name
huangyu       a     e
pihao         b     f

In [177]:
a.columns

Index(['huangyu', 'pihao'], dtype='object', name='name1')

In [178]:
index=pd.Index([1,2])

In [179]:
a=pd.DataFrame(a,index=index)

In [180]:
a

name1 huangyu pihao
1         NaN   NaN
2         NaN   NaN

In [181]:
#重建索引
ser=pd.Series(['a','b','c','d'],index=range(4))

In [182]:
ser

0    a
1    b
2    c
3    d
dtype: object

In [183]:
ser.reindex(range(10),method='ffill')

0    a
1    b
2    c
3    d
4    d
5    d
6    d
7    d
8    d
9    d
dtype: object

In [184]:
new_ser=ser.drop(0)

In [185]:
new_ser

1    b
2    c
3    d
dtype: object

In [186]:
df1

            huangyu pihao houpeng    5
huangyu           a     e       i  1.0
pihao             b     f       g  2.0
houpen            c     g       k  NaN
lixuqing          d     h       l  NaN
qiujing           f     d       e  4.0
reshaobo          g     f       r  3.0
zangzhouwei       d     g       t  NaN

In [187]:
df1.drop('huangyu',axis=1)

            pihao houpeng    5
huangyu         e       i  1.0
pihao           f       g  2.0
houpen          g       k  NaN
lixuqing        h       l  NaN
qiujing         d       e  4.0
reshaobo        f       r  3.0
zangzhouwei     g       t  NaN

In [188]:
ser

0    a
1    b
2    c
3    d
dtype: object

In [189]:
ser[[0,3]]

0    a
3    d
dtype: object

In [190]:
ser

0    a
1    b
2    c
3    d
dtype: object

In [191]:
df1

            huangyu pihao houpeng    5
huangyu           a     e       i  1.0
pihao             b     f       g  2.0
houpen            c     g       k  NaN
lixuqing          d     h       l  NaN
qiujing           f     d       e  4.0
reshaobo          g     f       r  3.0
zangzhouwei       d     g       t  NaN

In [192]:
df1['huangyu']

huangyu        a
pihao          b
houpen         c
lixuqing       d
qiujing        f
reshaobo       g
zangzhouwei    d
Name: huangyu, dtype: object

In [193]:
df[:2]

  huangyu pihao houpeng
0       a     e       i
1       b     f       g

In [194]:
#使用loc和iloc

data = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index = ['ohio','colorado','utah','new york'],
                     columns = ['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [195]:
data.loc['colorado',['two','three']]  #使用轴标签（loc）或整数索引（iloc），从DataFrame选择行和列的子集

two      5
three    6
Name: colorado, dtype: int32

In [196]:

data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: utah, dtype: int32

In [197]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                   columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                   columns = list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [198]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [199]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [200]:
#进行填充

In [201]:
df2['a']

0     0.0
1     5.0
2    10.0
3    15.0
Name: a, dtype: float64

In [202]:
df2[1,1]=None

In [203]:
df2

      a     b     c     d     e (1, 1)
0   0.0   1.0   2.0   3.0   4.0   None
1   5.0   6.0   7.0   8.0   9.0   None
2  10.0  11.0  12.0  13.0  14.0   None
3  15.0  16.0  17.0  18.0  19.0   None

In [204]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [205]:
df1+df2

      a     b     c     d   e (1, 1)
0   0.0   2.0   4.0   6.0 NaN    NaN
1   9.0  11.0  13.0  15.0 NaN    NaN
2  18.0  20.0  22.0  24.0 NaN    NaN
3   NaN   NaN   NaN   NaN NaN    NaN

In [206]:
df1.add(df2,fill_value=0)

      a     b     c     d     e (1, 1)
0   0.0   2.0   4.0   6.0   4.0    NaN
1   9.0  11.0  13.0  15.0   9.0    NaN
2  18.0  20.0  22.0  24.0  14.0    NaN
3  15.0  16.0  17.0  18.0  19.0    NaN

In [207]:
frame = pd.DataFrame(np.random.randn(4,3),
                     columns = list('bde'),
                     index = ['ohio','colorado','utah','new york'])
frame

                 b         d         e
ohio      0.245249 -0.315250  0.805762
colorado -0.216329 -0.576957 -0.104792
utah     -0.264183  0.132904 -1.233847
new york -0.796106 -0.882131 -0.584149

In [208]:
np.abs(frame)

                 b         d         e
ohio      0.245249  0.315250  0.805762
colorado  0.216329  0.576957  0.104792
utah      0.264183  0.132904  1.233847
new york  0.796106  0.882131  0.584149

In [209]:
f = lambda x:x.max() - x.min()

In [210]:
frame.apply(f,axis='columns')

ohio        1.121012
colorado    0.472165
utah        1.366750
new york    0.297981
dtype: float64

In [211]:
#排序与排名

In [212]:
obj = pd.Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [213]:
df3 = pd.DataFrame(np.arange(8).reshape((2,4)),
                   index = ['three','one'],
                   columns = ['d','a','b','c'])
df3.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [214]:
df3.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [215]:
df3.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [216]:
#在排序时，任何缺失值默认都会被放到Series的末尾
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [217]:
#当排序一个DataFrame时，你可能希望根据一个或多个列中的值进行排序。将一个或多个列的名字传递给sort_values的by选项即可达到该目的
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [218]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [219]:
obj.rank(ascending=False, method='max')

0    2.0
1    NaN
2    1.0
3    NaN
4    4.0
5    3.0
dtype: float64

In [220]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0,1],'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [221]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [222]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [223]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [224]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [225]:
#相关系数和协方差后面复习概率坤在补

In [120]:
#第六章

In [226]:
E:\研究生阶段的文件都放在这里以免迷路OK\jupyter

SyntaxError: unexpected character after line continuation character (<ipython-input-226-53f0cbe78d2b>, line 1)

In [228]:

import pandas as pd
f = open('E:\研究生阶段的文件都放在这里以免迷路OK\jupyter\HY5.txt')
df = pd.read_csv(f)
df

   Unnamed: 0   a    b  c  d
0           0  HY  123  1  2
1           1   p  345  2  4
2           2   i  256  w  2
3           3   z  367  2  3

In [230]:
f = open('E:\研究生阶段的文件都放在这里以免迷路OK\jupyter\HY5.txt')
pd.read_table(f, sep=',')

   Unnamed: 0   a    b  c  d
0           0  HY  123  1  2
1           1   p  345  2  4
2           2   i  256  w  2
3           3   z  367  2  3

In [232]:
#json
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [233]:
import json
result = json.loads(obj)    #json.loads即可将JSON字符串转换成Python形式
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [234]:
siblings = pd.DataFrame(result['siblings'],columns=['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [235]:
#后面的HTML和XML自己现在不知道，无从下手。后期我自己吧它补上

In [237]:
frame=pd.read_excel('E:\研究生阶段的文件都放在这里以免迷路OK\jupyter\HY3.xlsx')

In [238]:
frame

      name   huangyu
0      age        23
1  loction  sichang
2      sex      man

In [242]:
#这是自己以前写的
import pymysql

In [241]:
db = pymysql.connect(host='localhost',
                    user='root',
                    port=3306,
                    charset='utf8',
                    passwd="1234",
                    db="test"
                    )
cur = db.cursor() #创建一个游标

In [243]:
sql= f'insert into hy(name) values ("data")' #format的简写形式,同时建立insert插入语句
try:
    cur.execute(sql) #执行语句
    db.commit()     #提交
except:
    db.rollback()  #发生错误回滚

In [244]:
#上面的是自己以前用过的连接mysql，和书上的大同小异。功能已经实现过，故本次是查漏补缺。有的知识点还需要加强